Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ8110CA80208.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CAN0</name>
         <version>037234a0</version>
         <description>Control Area Network</description>
         <groupName>CAN</groupName>
         <prependToName>CAN_</prependToName>
         <baseAddress>0x45060000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x104</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CAN0</name>
            <description>Controller Area Network 0</description>
            <value>194</value>
         </interrupt>
         <registers>
            <register>
               <name>CREL</name>
               <description>Core Release</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x32300000</resetValue>
               <fields>
                  <field>
                     <name>SUBSTEP</name>
                     <description>Sub-step of Core Release</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STEP</name>
                     <description>Step of Core Release</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REL</name>
                     <description>Core Release</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENDN</name>
               <description>Endian</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x87654321</resetValue>
               <fields>
                  <field>
                     <name>ETV</name>
                     <description>Endianness Test Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MRCFG</name>
               <description>Message RAM Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET</name>
                     <description>Base address offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBTP</name>
               <description>Fast Bit Timing and Prescaler</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000A33</resetValue>
               <fields>
                  <field>
                     <name>DSJW</name>
                     <description>Data (Re)Synchronization Jump Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTSEG2</name>
                     <description>Data time segment after sample point</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTSEG1</name>
                     <description>Data time segment before sample point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBRP</name>
                     <description>Data Baud Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TDC</name>
                     <description>Tranceiver Delay Compensation</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEST</name>
               <description>Test</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LBCK</name>
                     <description>Loop Back Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX</name>
                     <description>Control of Transmit Pin</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSelect</name>
                        <enumeratedValue>
                           <name>CORE</name>
                           <description>TX controlled by CAN core</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAMPLE</name>
                           <description>TX monitoring sample point</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOMINANT</name>
                           <description>Dominant (0) level at pin CAN_TX</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECESSIVE</name>
                           <description>Recessive (1) level at pin CAN_TX</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>Receive Pin</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RWD</name>
               <description>RAM Watchdog</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDC</name>
                     <description>Watchdog Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WDV</name>
                     <description>Watchdog Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCCR</name>
               <description>CC Control</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Initialization</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCE</name>
                     <description>Configuration Change Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASM</name>
                     <description>ASM Restricted Operation Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSA</name>
                     <description>Clock Stop Acknowledge</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSR</name>
                     <description>Clock Stop Request</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>Bus Monitoring Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAR</name>
                     <description>Disable Automatic Retransmission</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Test Mode Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDOE</name>
                     <description>FD Operation Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BRSE</name>
                     <description>Bit Rate Switch Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PXHD</name>
                     <description>Protocol Exception Handling Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EFBI</name>
                     <description>Edge Filtering during Bus Integration</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXP</name>
                     <description>Transmit Pause</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NBTP</name>
               <description>Nominal Bit Timing and Prescaler</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x06000A03</resetValue>
               <fields>
                  <field>
                     <name>NTSEG2</name>
                     <description>Nominal Time segment after sample point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NTSEG1</name>
                     <description>Nominal Time segment before sample point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NBRP</name>
                     <description>Nominal Baud Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NSJW</name>
                     <description>Nominal (Re)Synchronization Jump Width</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCC</name>
               <description>Timestamp Counter Configuration</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSS</name>
                     <description>Timestamp Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TSSSelect</name>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>Timestamp counter value always 0x0000</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INC</name>
                           <description>Timestamp counter value incremented by TCP</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCP</name>
                     <description>Timestamp Counter Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCV</name>
               <description>Timestamp Counter Value</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSC</name>
                     <description>Timestamp Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCC</name>
               <description>Timeout Counter Configuration</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0xFFFF0000</resetValue>
               <fields>
                  <field>
                     <name>ETOC</name>
                     <description>Enable Timeout Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOS</name>
                     <description>Timeout Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TOSSelect</name>
                        <enumeratedValue>
                           <name>CONT</name>
                           <description>Continuout operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXEF</name>
                           <description>Timeout controlled by TX Event FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXF0</name>
                           <description>Timeout controlled by Rx FIFO 0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXF1</name>
                           <description>Timeout controlled by Rx FIFO 1</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOP</name>
                     <description>Timeout Period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCV</name>
               <description>Timeout Counter Value</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>TOC</name>
                     <description>Timeout Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <description>Error Counter</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEC</name>
                     <description>Transmit Error Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Receive Error Counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>RP</name>
                     <description>Receive Error Passive</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEL</name>
                     <description>CAN Error Logging</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
