Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ8110CA80208.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DRMTCM</name>
         <version>037701a0</version>
         <description>DRM TCM ECC</description>
         <baseAddress>0x44820000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x50</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DRMTCM</name>
            <description>TCM RAM ECC Interrupt</description>
            <value>36</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>CONTROL ENABLE REGISTER A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>DRMTCM Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>DRMTCM ECC Enable (ON) bit (default ECC is always enabled)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>CONTROL ENABLE REGISTER B</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00070707</resetValue>
               <fields>
                  <field>
                     <name>IERRCNT</name>
                     <description>ITCM ERROR MAXIMUM COUNT (default 0x7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>D0ERRCNT</name>
                     <description>D0TCM ERROR MAXIMUM COUNT (default 0x7)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>D1ERRCNT</name>
                     <description>D1TCM ERROR MAXIMUM COUNT (default 0x7)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IWAITSTEN</name>
                     <description>ITCM ONE WAIT STATE ENABLE BIT</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DWAITSTEN</name>
                     <description>D1TCM and D0TCM ONE WAIT STATE ENABLE BIT</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IERCNTDIS</name>
                     <description>ITCM ERROR COUNTER DISABLE BIT</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0ERCNTDIS</name>
                     <description>D0TCM ERROR COUNTER DISABLE BIT</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1ERCNTDIS</name>
                     <description>D1TCM ERROR COUNTER DISABLE BIT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>SYNC BUSY REGISTER</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software reset busy bit   --- Synchronizing Busy bit for SWRST</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTEN</name>
                     <description>Fault Injection Enabled busy bit   --- Synchronizing Busy bit for FLTEN register (when hard-ware set this bit, no writes are allowed to the FLTCTRL register until after the synchronizing is not busy).</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>INTERRUPT ENABLE CLR REGISTER</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISERREN</name>
                     <description>ITCM Single Bit Error Detection Flag bit Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDERREN</name>
                     <description>ITCM Double Bit Error Detection Flag bit Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IECCECNTEN</name>
                     <description>ITCM ECC Error Count Flag bit Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0SERREN</name>
                     <description>D0TCM Single Bit Error Detection Flag bit Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0DERREN</name>
                     <description>D0TCM Double Bit Error Detection Flag bit Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0ECCECNTEN</name>
                     <description>D0TCM ECC Error Count Flag bit Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1SERREN</name>
                     <description>D1TCM Single Bit Error Detection Flag bit Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1DERREN</name>
                     <description>D1TCM Double Bit Error Detection Flag bit Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1ECCECNTEN</name>
                     <description>D1TCM ECC Error Count Flag bit Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTCAPEN</name>
                     <description>Fault Capture interrupt enable bit Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>INTERRUPT ENABLE SET REGISTER</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISERREN</name>
                     <description>ITCM Single Bit Error Detection Flag bit Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDERREN</name>
                     <description>ITCM Double Bit Error Detection Flag bit Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IECCECNTEN</name>
                     <description>ITCM ECC Error Count Flag bit Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0SERREN</name>
                     <description>D0TCM Single Bit Error Detection Flag bit Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0DERREN</name>
                     <description>D0TCM Double Bit Error Detection Flag bit Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0ECCECNTEN</name>
                     <description>D0TCM ECC Error Count Flag bit Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1SERREN</name>
                     <description>D1TCM Single Bit Error Detection Flag bit Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1DERREN</name>
                     <description>D1TCM Double Bit Error Detection Flag bit Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1ECCECNTEN</name>
                     <description>D1TCM ECC Error Count Flag bit Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTCAPEN</name>
                     <description>Fault Capture interrupt enable bit Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>INTERRUPT FLAG REGISTER</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ISERR</name>
                     <description>ITCM Single Bit Error Detection Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDERR</name>
                     <description>ITCM Double Bit Error Detection Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IECCECNT</name>
                     <description>ITCM ECC Error Count Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0SERR</name>
                     <description>D0TCM Single Bit Error Detection Flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0DERR</name>
                     <description>D0TCM Double Bit Error Detection Flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D0ECCECNT</name>
                     <description>D0TCM ECC Error Count Flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1SERR</name>
                     <description>D1TCM Single Bit Error Detection Flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1DERR</name>
                     <description>D1TCM Double Bit Error Detection Flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>D1ECCECNT</name>
                     <description>D1TCM ECC Error Count Flag</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTCAP</name>
                     <description>Fault Capture interrupt</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTCTRL</name>
               <description>FAULT INJECTION CONTROL REGISTER</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTEN</name>
                     <description>Fault Injection Enabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTMD</name>
                     <description>Fault Mode Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFLTPTR</name>
               <description>ITCM FAULT INJECTION POINTER REGISTER</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLT1PTR</name>
                     <description>ECC Fault injection Bit position pointer (for single bit error).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>FLT2PTR</name>
                     <description>ECC Fault injection Bit position pointer (for double bit error).</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFLTADR</name>
               <description>ITCM FAULT INJECTION ADDRESS REGISTER</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IFLTADR</name>
                     <description>Instruction ITCM ECC Fault Injection, Address Match Com-pare bits.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFLTCAP</name>
               <description>ITCM FAULT ERROR CAPTURE ADDRESS REGISTER</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTADR</name>
                     <description>Instruction TCM ECC Fault Address bits which caused the ECC Error.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
                  <field>
                     <name>ITCMMASTER</name>
                     <description>Master ID of the requester of the current Error access.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFLTPAR</name>
               <description>ITCM FAULT PARITY REGISTER</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECIN</name>
                     <description>Single Error Parity Bits from ITCM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFLTSYN</name>
               <description>ITCM FAULT ECC SYNDROME REGISTER</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECSYN</name>
                     <description>Single Error Syndrome</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ERR1</name>
                     <description>Single Bit Error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR2</name>
                     <description>Double bit Error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLTPTR</name>
               <description>DTCM FAULT INJECTION POINTER REGISTER</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLT1PTR</name>
                     <description>ECC Fault injection Bit position pointer (for single bit error).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>FLT2PTR</name>
                     <description>ECC Fault injection Bit position pointer (for double bit error).</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLTADR</name>
               <description>DTCM FAULT INJECTION ADDRESS REGISTER</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTADR</name>
                     <description>Data TCM ECC Fault Injection, Address Match Compare bits.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
                  <field>
                     <name>D1D0EN</name>
                     <description>Fault Injection D1 or D0 Address Enable.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>D0FLTCAP</name>
               <description>D0TCM FAULT ERROR CAPTURE ADDRESS REGISTER</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTADR</name>
                     <description>Data 0 TCM ECC Fault Address bits which caused the ECC Error.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
                  <field>
                     <name>TCMMASTER</name>
                     <description>Master ID of the requester of the current Error access.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>D0FLTPAR</name>
               <description>D0TCM FAULT PARITY REGISTER</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECIN</name>
                     <description>Single Error Parity Bits from D0TCM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
